app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE ((lower(first_name || ' ' || last_name)) LIKE lower('%trudeau%') OR lower(first_name) like lower('%trudeau%') OR lower(last_name) like lower('%trudeau%'))
---
  def index
    if(params[:s]) then
      @contacts=Contact.search(params[:s])

INSERT INTO "contacts" ("birthday", "created_at", "facebook_id", "first_name", "gender", "graduating_class", "is_group_or_parish", "last_name", "myspace_id", "safe_child_video_letter_sent", "school", "twitter_id", "updated_at", "watched_safe_child_video", "youth_group_leader") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "gender" = $1, "is_group_or_parish" = $2, "facebook_id" = $3, "myspace_id" = $4, "twitter_id" = $5, "graduating_class" = $6, "school" = $7, "youth_group_leader" = $8, "watched_safe_child_video" = $9, "safe_child_video_letter_sent" = $10, "birthday" = $11, "updated_at" = $12 WHERE "contacts"."id" = 5
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)