app/controllers/images_controller.rb

	def show
	    @img = Image.find(params[:id])
---
SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", "1"]]

	def create
		@img = Image.new
		@img.set_bytes params[:bytes]
	   respond_to do |format|
	      if @img.save
---
INSERT INTO "images" ("bytes", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["bytes", "<556305 bytes of binary data>"], ["created_at", Mon, 15 Jul 2013 01:20:21 UTC +00:00], ["updated_at", Mon, 15 Jul 2013 01:20:21 UTC +00:00]]